"""
Напишите программу вычисления арифметического выражения заданного строкой.
Используйте операции +,-,/,*. приоритет операций стандартный.
По возможности реализуйте использования скобок, меняющих приоритет операций.
Ввод: значение типа <str>
Вывод: значение числового типа данных
"""

str = '3+2*2'
print(eval(str))
